---
kind: property
id: P:Autodesk.Revit.DB.EdgeArray.Item(System.Int32)
source: html/b539971b-8ce1-32d0-0eda-9759fe720a75.htm
---
# Autodesk.Revit.DB.EdgeArray.Item Property

Gets or sets an edge at a specified index within the array.

## Syntax (C#)
```csharp
public virtual Edge this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the edge to be set or retrieved.

## Returns
Returns the edge at the specified index.